---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.CircularLoopInPipeSizing
source: html/4bb998b0-7378-c517-17e9-cd288e075dd2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.CircularLoopInPipeSizing Property

Circular loop detected during pipe sizing. The loop may be avoided by modifying segment settings in the pipe routing preference.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularLoopInPipeSizing { get; }
```